Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
            = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "pjr8lx"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "datasets-id-filtering_terms_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "pjr8lx"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants will be created
  + resource "aws_api_gateway_method" "datasets-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "p0v24v"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "datasets-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "p0v24v"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals will be created
  + resource "aws_api_gateway_method" "datasets-id-individuals" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "hbsf0m"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_method" "datasets-id-individuals_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "hbsf0m"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id_post will be created
  + resource "aws_api_gateway_method" "datasets-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "988914"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.datasets_post will be created
  + resource "aws_api_gateway_method" "datasets_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "7qllhx"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.dportal_proxy will be created
  + resource "aws_api_gateway_method" "dportal_proxy" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "ANY"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = "jsr0cp"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.entry_types will be created
  + resource "aws_api_gateway_method" "entry_types" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "xx70sd"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.filtering_terms will be created
  + resource "aws_api_gateway_method" "filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "q86gdu"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants will be created
  + resource "aws_api_gateway_method" "g_variants" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "xadyn3"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id will be created
  + resource "aws_api_gateway_method" "g_variants-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "4k5xwj"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_method" "g_variants-id-biosamples" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "eu5xf3"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_method" "g_variants-id-biosamples_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "eu5xf3"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals will be created
  + resource "aws_api_gateway_method" "g_variants-id-individuals" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "ngo9l8"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_method" "g_variants-id-individuals_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "ngo9l8"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id_post will be created
  + resource "aws_api_gateway_method" "g_variants-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "4k5xwj"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.g_variants_post will be created
  + resource "aws_api_gateway_method" "g_variants_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "xadyn3"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals will be created
  + resource "aws_api_gateway_method" "individuals" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "tszbth"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms will be created
  + resource "aws_api_gateway_method" "individuals-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "2jwps9"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "individuals-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "2jwps9"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id will be created
  + resource "aws_api_gateway_method" "individuals-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "2jfdqa"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method" "individuals-id-biosamples" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "cbna1t"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "cbna1t"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method" "individuals-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "3p7266"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "3p7266"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post will be created
  + resource "aws_api_gateway_method" "individuals-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "2jfdqa"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post will be created
  + resource "aws_api_gateway_method" "individuals_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "tszbth"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.info will be created
  + resource "aws_api_gateway_method" "info" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "sjzxnk"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.map will be created
  + resource "aws_api_gateway_method" "map" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "2bkfl5"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.root-get will be created
  + resource "aws_api_gateway_method" "root-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "d7i405w57f"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs will be created
  + resource "aws_api_gateway_method" "runs" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "6nxeg0"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms will be created
  + resource "aws_api_gateway_method" "runs-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "k5ywtx"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "k5ywtx"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-id will be created
  + resource "aws_api_gateway_method" "runs-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "fps4t7"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses will be created
  + resource "aws_api_gateway_method" "runs-id-analyses" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "rt4ilc"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "rt4ilc"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants will be created
  + resource "aws_api_gateway_method" "runs-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "ih2jru"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "ih2jru"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post will be created
  + resource "aws_api_gateway_method" "runs-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = "fps4t7"
      + rest_api_id        = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method.runs_post will be created
  + resource "aws_api_gateway_method" "runs_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "6nxeg0"
      + rest_api_id      = "sse4jppfz8"
    }

  # module.sbeacon.aws_api_gateway_method_response.admin_proxy will be created
  + resource "aws_api_gateway_method_response" "admin_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + resource_id         = "yrayho"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses will be created
  + resource "aws_api_gateway_method_response" "analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "ix2myj"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "analyses-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "eylaw8"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "analyses-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "eylaw8"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id will be created
  + resource "aws_api_gateway_method_response" "analyses-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "m5i90n"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "analyses-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "q3gd41"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "analyses-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "q3gd41"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id_post will be created
  + resource "aws_api_gateway_method_response" "analyses-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "m5i90n"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses_post will be created
  + resource "aws_api_gateway_method_response" "analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "ix2myj"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples will be created
  + resource "aws_api_gateway_method_response" "biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "yhw4hz"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "biosamples-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "p8fp4p"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "p8fp4p"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id will be created
  + resource "aws_api_gateway_method_response" "biosamples-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "cj0t4v"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "5z5zup"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "5z5zup"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "5pywyj"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "5pywyj"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "0omln3"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "0omln3"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "cj0t4v"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples_post will be created
  + resource "aws_api_gateway_method_response" "biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "yhw4hz"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.configuration will be created
  + resource "aws_api_gateway_method_response" "configuration" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "zceely"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets will be created
  + resource "aws_api_gateway_method_response" "datasets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "7qllhx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "datasets-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "gwxbpd"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "gwxbpd"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id will be created
  + resource "aws_api_gateway_method_response" "datasets-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "988914"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "datasets-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "gwc4y7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "gwc4y7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "pjr8lx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "pjr8lx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "p0v24v"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "p0v24v"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "hbsf0m"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "hbsf0m"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "988914"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets_post will be created
  + resource "aws_api_gateway_method_response" "datasets_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "7qllhx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.dportal_proxy will be created
  + resource "aws_api_gateway_method_response" "dportal_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + resource_id         = "jsr0cp"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.entry_types will be created
  + resource "aws_api_gateway_method_response" "entry_types" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "xx70sd"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.filtering_terms will be created
  + resource "aws_api_gateway_method_response" "filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "q86gdu"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants will be created
  + resource "aws_api_gateway_method_response" "g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "xadyn3"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id will be created
  + resource "aws_api_gateway_method_response" "g_variants-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "4k5xwj"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "eu5xf3"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "eu5xf3"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "ngo9l8"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "ngo9l8"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants-id_post will be created
  + resource "aws_api_gateway_method_response" "g_variants-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "4k5xwj"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.g_variants_post will be created
  + resource "aws_api_gateway_method_response" "g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "xadyn3"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals will be created
  + resource "aws_api_gateway_method_response" "individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "tszbth"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "2jwps9"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "individuals-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "2jwps9"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id will be created
  + resource "aws_api_gateway_method_response" "individuals-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "2jfdqa"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "cbna1t"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "cbna1t"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "3p7266"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "3p7266"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals-id_post will be created
  + resource "aws_api_gateway_method_response" "individuals-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "2jfdqa"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.individuals_post will be created
  + resource "aws_api_gateway_method_response" "individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "tszbth"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.info will be created
  + resource "aws_api_gateway_method_response" "info" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "sjzxnk"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.map will be created
  + resource "aws_api_gateway_method_response" "map" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "2bkfl5"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.root-get will be created
  + resource "aws_api_gateway_method_response" "root-get" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "d7i405w57f"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs will be created
  + resource "aws_api_gateway_method_response" "runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "6nxeg0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "k5ywtx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "runs-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "k5ywtx"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id will be created
  + resource "aws_api_gateway_method_response" "runs-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "fps4t7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "rt4ilc"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "rt4ilc"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = "ih2jru"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "runs-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "ih2jru"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs-id_post will be created
  + resource "aws_api_gateway_method_response" "runs-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "fps4t7"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.runs_post will be created
  + resource "aws_api_gateway_method_response" "runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = "6nxeg0"
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = "sse4jppfz8"
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_settings.BeaconApi will be created
  + resource "aws_api_gateway_method_settings" "BeaconApi" {
      + id          = (known after apply)
      + method_path = "*/*"
      + rest_api_id = "sse4jppfz8"
      + stage_name  = "prod"

      + settings {
          + cache_data_encrypted                       = (known after apply)
          + cache_ttl_in_seconds                       = (known after apply)
          + caching_enabled                            = (known after apply)
          + data_trace_enabled                         = (known after apply)
          + logging_level                              = (known after apply)
          + metrics_enabled                            = (known after apply)
          + require_authorization_for_cache_control    = (known after apply)
          + throttling_burst_limit                     = 1000
          + throttling_rate_limit                      = 100
          + unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be created
  + resource "aws_api_gateway_stage" "BeaconApi" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "sse4jppfz8"
      + stage_name    = "prod"
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + web_acl_arn   = (known after apply)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be created
  + resource "aws_athena_workgroup" "sbeacon-workgroup" {
      + arn           = (known after apply)
      + force_destroy = true
      + id            = (known after apply)
      + name          = "query_workgroup"
      + state         = "ENABLED"
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }

      + configuration {
          + enforce_workgroup_configuration    = false
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + engine_version {
              + effective_engine_version = (known after apply)
              + selected_engine_version  = "Athena engine version 3"
            }

          + result_configuration {
              + output_location = "s3://gasi-metadata-20250524134912137300000004/query-results/"
            }
        }
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-index-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms_index"
        }
      + policy_body   = (known after apply)
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = jsonencode(
            {
              + Parameters = {
                  + DatabaseName = {
                      + Type = "String"
                    }
                  + TableName    = {
                      + Type = "String"
                    }
                }
              + Resources  = {
                  + SBeaconTermsGlueCatalogTable = {
                      + Properties = {
                          + CatalogId    = {
                              + Ref = "AWS::AccountId"
                            }
                          + DatabaseName = {
                              + Ref = "DatabaseName"
                            }
                          + TableInput   = {
                              + Name              = {
                                  + Ref = "TableName"
                                }
                              + Parameters        = {
                                  + EXTERNAL       = "TRUE"
                                  + numFiles       = "-1"
                                  + "orc.compress" = "SNAPPY"
                                }
                              + PartitionKeys     = [
                                  + {
                                      + Comment = "partition by kind"
                                      + Name    = "kind"
                                      + Type    = "string"
                                    },
                                ]
                              + StorageDescriptor = {
                                  + Columns      = [
                                      + {
                                          + Name = "id"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "term"
                                          + Type = "string"
        
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.